In [2]:
import pandas as pd

### concat
- 가장 심플하게 합쳐줌

In [3]:
# concat
# merge

df1 = pd.DataFrame({
    "id":[1,2,3],
    "customer_id":[1,2,3],
    "customer_name":['Robert','Peter','Dave']
})

df2 = pd.DataFrame({
    "id":[1,2,4],
    "customer_id":[100,200,300],
    "order_date":['2024-01-21','2024-02-03','2024-10-01']
})

In [5]:
print(df1)
print(df2)

   id  customer_id customer_name
0   1            1        Robert
1   2            2         Peter
2   3            3          Dave
   id  customer_id  order_date
0   1          100  2024-01-21
1   2          200  2024-02-03
2   4          300  2024-10-01

In [ ]:
# concat() : 위/아래 연결 -> 가장 심플하게 연결해줌
# axis=1 : 부여시, 옆으로 연결 

pd.concat([df1, df2])
pd.concat([df1, df2], ignore_index=True)

   id  customer_id customer_name  order_date
0   1            1        Robert         NaN
1   2            2         Peter         NaN
2   3            3          Dave         NaN
3   1          100           NaN  2024-01-21
4   2          200           NaN  2024-02-03
5   4          300           NaN  2024-10-01

In [7]:
pd.concat([df1, df2], axis=1)

   id  customer_id customer_name  id  customer_id  order_date
0   1            1        Robert   1          100  2024-01-21
1   2            2         Peter   2          200  2024-02-03
2   3            3          Dave   4          300  2024-10-01

### merge
- sql join 과 같은 개념

In [ ]:
# left outer join

pd.merge(df1, df2, how='left', on='id')

   id  customer_id_x customer_name  customer_id_y  order_date
0   1              1        Robert          100.0  2024-01-21
1   2              2         Peter          200.0  2024-02-03
2   3              3          Dave            NaN         NaN

In [11]:
# right outer join
pd.merge(df1, df2, how='right', on='id')

   id  customer_id_x customer_name  customer_id_y  order_date
0   1            1.0        Robert            100  2024-01-21
1   2            2.0         Peter            200  2024-02-03
2   4            NaN           NaN            300  2024-10-01

In [12]:
# inner join
pd.merge(df1, df2, how='inner', on='id')

   id  customer_id_x customer_name  customer_id_y  order_date
0   1              1        Robert            100  2024-01-21
1   2              2         Peter            200  2024-02-03

In [19]:
df1
# id 컬럼을 index 로 변경
df1.set_index('id', inplace=True)
df2.set_index('id', inplace=True)

KeyError: "None of ['id'] are in the columns"

In [ ]:
df2

    customer_id  order_date
id
1           100  2024-01-21
2           200  2024-02-03
4           300  2024-10-01

In [21]:
# index 기준으로 merge 하기
pd.merge(df1, df2, left_index=True, right_index=True)

    customer_id_x customer_name  customer_id_y  order_date
id
1               1        Robert            100  2024-01-21
2               2         Peter            200  2024-02-03

In [ ]:
# index 기준으로 merge + outer

pd.merge(df1, df2, left_index=True, right_index=True, how='outer')

    customer_id_x customer_name  customer_id_y  order_date
id
1             1.0        Robert          100.0  2024-01-21
2             2.0         Peter          200.0  2024-02-03
3             3.0          Dave            NaN         NaN
4             NaN           NaN          300.0  2024-10-01